{"index": "dev-0", "cause": "Water flows from the spout of the faucet.", "effect": "The man turned on the tap.", "conceptual_explanation": "Turning on the tap causes water to flow from the faucet."}
{"index": "dev-1", "cause": "She lost her appetite.", "effect": "The girl found a bug in the cereal.", "conceptual_explanation": "Finding a bug in the cereal can lead to losing one's appetite."}
{"index": "dev-2", "cause": "She received her pension.", "effect": "The woman retired.", "conceptual_explanation": "Receiving her pension likely means the woman has reached retirement age and can now retire."}
{"index": "dev-3", "cause": "I turned off the light in the empty room.", "effect": "I want to save energy.", "conceptual_explanation": "Turning off the light in an empty room is a way to save energy."}
{"index": "dev-4", "cause": "The chef baked it.", "effect": "The hamburger has turned brown.", "conceptual_explanation": "Baking the hamburger likely caused it to turn brown."}
{"index": "dev-5", "cause": "I rejected his offer.", "effect": "I don't trust the salesman's sales.", "conceptual_explanation": "Rejecting the offer might indicate a lack of trust in the salesman's sales pitch."}
{"index": "dev-6", "cause": "The weather forecast predicted a storm.", "effect": "I decided to stay at home overnight.", "conceptual_explanation": "The prediction of a storm led to the decision to stay at home overnight."}
{"index": "dev-7", "cause": "I was crying.", "effect": "My eyes became red and swollen.", "conceptual_explanation": "Crying often leads to eyes becoming red and swollen."}
{"index": "dev-8", "cause": "I blow out the wick.", "effect": "The flame on the candle went out.", "conceptual_explanation": "Blowing out the wick extinguishes the flame on the candle."}
{"index": "dev-9", "cause": "He had a headache the next day.", "effect": "The man drank badly at the party.", "conceptual_explanation": "Drinking heavily at the party likely caused the headache the next day."}
{"index": "dev-10", "cause": "The man rolled the bowling ball downhill.", "effect": "The bowling ball knocked over the bowling bottle.", "conceptual_explanation": "Rolling the bowling ball downhill likely caused it to knock over the bowling pins."}
{"index": "dev-11", "cause": "His obituary appeared in the newspaper.", "effect": "The community learned of the man’s death.", "conceptual_explanation": "The appearance of his obituary in the newspaper informed the community of the man's death."}
{"index": "dev-12", "cause": "I lost my data.", "effect": "My computer is broken.", "conceptual_explanation": "Losing data could indicate a malfunction or breakage in the computer."}
{"index": "dev-13", "cause": "She thinks the boss's behavior is immoral.", "effect": "The woman resigned.", "conceptual_explanation": "Considering the boss's behavior immoral might have led to the decision to resign."}
{"index": "dev-14", "cause": "Her teammate threw it to her.", "effect": "The player caught the ball.", "conceptual_explanation": "The teammate throwing the ball likely caused the player to catch it."}
{"index": "dev-15", "cause": "There was an uproar in the court.", "effect": "The judge hit the gavel hard.", "conceptual_explanation": "The uproar in the court may have prompted the judge to hit the gavel hard to restore order."}
{"index": "dev-16", "cause": "The children stepped on her garden.", "effect": "The woman drove the children out of her house.", "conceptual_explanation": "Stepping on her garden likely led to the woman driving the children out of her house."}
{"index": "dev-17", "cause": "They accepted the ransom.", "effect": "The kidnappers released the hostages.", "conceptual_explanation": "Accepting the ransom likely resulted in the release of the hostages by the kidnappers."}
{"index": "dev-18", "cause": "He cut the onion.", "effect": "The chef's eyes were weeping.", "conceptual_explanation": "Cutting the onion likely caused the chef's eyes to tear up."}
{"index": "dev-19", "cause": "Her fingers burned on the toaster.", "effect": "The woman rinsed her fingers with cold water.", "conceptual_explanation": "Burning her fingers on the toaster likely led to rinsing them with cold water."}
{"index": "dev-20", "cause": "The teacher corrected her.", "effect": "The student misspelled the word.", "conceptual_explanation": "Being corrected by the teacher might indicate that the student misspelled the word."}
{"index": "dev-21", "cause": "I took a deep breath.", "effect": "I recovered from my anger.", "conceptual_explanation": "Taking a deep breath can help in calming down and recovering from anger."}
{"index": "dev-22", "cause": "The soap on my hands was washed away.", "effect": "I put my hand under the running tap.", "conceptual_explanation": "The soap being washed away likely prompted putting the hand under the running tap."}
{"index": "dev-23", "cause": "He arranged a meeting with important clients.", "effect": "The man is wearing his best suit.", "conceptual_explanation": "Arranging a meeting with important clients might have led to wearing the best suit."}
{"index": "dev-24", "cause": "The woman rejected him.", "effect": "The man confessed to the woman.", "conceptual_explanation": "Being rejected by the woman might have prompted the man to confess his feelings."}
{"index": "dev-25", "cause": "He pressed through a nail.", "effect": "The driver's tire is flat.", "conceptual_explanation": "Pressing through a nail could have caused the driver's tire to go flat."}
{"index": "dev-26", "cause": "A tall man is sitting in front of me.", "effect": "My sight of the movie screen was blocked.", "conceptual_explanation": "The tall man sitting in front might have blocked the sight of the movie screen."}
{"index": "dev-27", "cause": "The sun is down.", "effect": "The driver turned on the headlights of the car.", "conceptual_explanation": "The sun being down likely prompted the driver to turn on the headlights of the car."}
{"index": "dev-28", "cause": "Her father took her dessert.", "effect": "The girl refused to eat her vegetables.", "conceptual_explanation": "Having her dessert taken away might have led the girl to refuse to eat her vegetables."}
{"index": "dev-29", "cause": "She sneezed.", "effect": "The woman covered her mouth with her hand.", "conceptual_explanation": "Sneezing often prompts covering the mouth with a hand."}
{"index": "dev-30", "cause": "The caller is waiting online.", "effect": "The secretary put the caller on hold.", "conceptual_explanation": "The caller waiting online likely prompted the secretary to put them on hold."}
{"index": "dev-31", "cause": "She broke her leg.", "effect": "The woman walks on crutches.", "conceptual_explanation": "Breaking her leg likely necessitated using crutches for walking."}
{"index": "dev-32", "cause": "I smoked.", "effect": "I have a cough.", "conceptual_explanation": "Smoking can often lead to developing a cough."}
{"index": "dev-33", "cause": "It's the hour.", "effect": "The clock rang.", "conceptual_explanation": "The hour being indicated likely prompted the clock to ring."}
{"index": "dev-34", "cause": "The egg broke.", "effect": "The cook beat the eggs on the edge of the bowl.", "conceptual_explanation": "The egg breaking might have necessitated beating the eggs on the edge of the bowl."}
{"index": "dev-35", "cause": "They are looking for illegal drugs.", "effect": "The police searched the criminal's car.", "conceptual_explanation": "Looking for illegal drugs likely prompted the police to search the criminal's car."}
{"index": "dev-36", "cause": "They retired.", "effect": "The couple went to the South for the winter.", "conceptual_explanation": "Retiring might have provided the opportunity for the couple to go to the South for the winter."}
{"index": "dev-37", "cause": "He promised his friend that he would go.", "effect": "The man felt obligated to participate in this event.", "conceptual_explanation": "Making a promise to his friend likely led the man to feel obligated to participate in the event."}
{"index": "dev-38", "cause": "She cancelled the wedding.", "effect": "The bride feels nervous before the wedding.", "conceptual_explanation": "Cancelling the wedding might have caused the bride to feel nervous before the wedding."}
{"index": "dev-39", "cause": "His hair turned gray.", "effect": "The man is getting old.", "conceptual_explanation": "Turning gray hair is often associated with aging, indicating that the man is getting old."}
{"index": "dev-40", "cause": "They cut the hamburger in half.", "effect": "Friends decided to share this hamburger.", "conceptual_explanation": "Cutting the hamburger in half likely prompted the friends to decide to share it."}
{"index": "dev-41", "cause": "The soda bubbled.", "effect": "I unscrewed the cap of the soda bottle.", "conceptual_explanation": "The soda bubbling might have prompted you to unscrew the cap of the soda bottle."}
{"index": "dev-42", "cause": "Their homework answers are the same.", "effect": "The pair of students was scrutinized by the teacher.", "conceptual_explanation": "Having the same homework answers likely led the pair of students to be scrutinized by the teacher."}
{"index": "dev-43", "cause": "He left his homework at home.", "effect": "The student was in a hurry to go to school on time.", "conceptual_explanation": "Leaving his homework at home might have caused the student to be in a hurry to go to school on time."}
{"index": "dev-44", "cause": "The reporter is very interested in the work of the humanitarian.", "effect": "The reporter wrote a biography about the life of the humanitarian.", "conceptual_explanation": "The reporter's interest in the work of the humanitarian likely prompted them to write a biography about the humanitarian's life."}
{"index": "dev-45", "cause": "He was excommunicated.", "effect": "The person ignored the authority of the church.", "conceptual_explanation": "Being excommunicated might indicate that the person ignored the authority of the church."}
{"index": "dev-46", "cause": "She used a hairpin to pull her hair back.", "effect": "The woman's hair fell on her face.", "conceptual_explanation": "Using a hairpin to pull her hair back likely led the woman's hair to fall on her face."}
{"index": "dev-47", "cause": "My fingers are swollen.", "effect": "My ring is stuck on my finger.", "conceptual_explanation": "The swelling of your fingers might have caused your ring to become stuck on your finger."}
{"index": "dev-48", "cause": "It stretched out.", "effect": "I pulled the rubber band.", "conceptual_explanation": "Stretching out might have prompted you to pull the rubber band."}
{"index": "dev-49", "cause": "My handprints are dry in the cement.", "effect": "I reached into the wet cement.", "conceptual_explanation": "Having dry handprints in the cement might have prompted you to reach into the wet cement."}
{"index": "dev-50", "cause": "I ran into poison ivy in the yard.", "effect": "My skin suddenly developed a rash.", "conceptual_explanation": "Running into poison ivy likely caused your skin to suddenly develop a rash."}
{"index": "dev-51", "cause": "I no longer receive new issues.", "effect": "My subscription to the magazine has expired.", "conceptual_explanation": "No longer receiving new issues likely indicates that your subscription to the magazine has expired."}
{"index": "dev-52", "cause": "He overturned his inference.", "effect": "The detective found the case abnormal.", "conceptual_explanation": "Overturning his inference might have prompted the detective to find the case abnormal."}
{"index": "dev-53", "cause": "His brother took his toys.", "effect": "The boy lost his temper.", "conceptual_explanation": "His brother taking his toys likely caused the boy to lose his temper."}
{"index": "dev-54", "cause": "He started to go to school.", "effect": "The child learned to read.", "conceptual_explanation": "Starting to go to school likely led the child to learn to read."}
{"index": "dev-55", "cause": "He had a big meal for lunch.", "effect": "The boy did not eat dinner.", "conceptual_explanation": "Having a big meal for lunch might have caused the boy to not feel hungry or want dinner."}
{"index": "dev-56", "cause": "She wants to ask her friend for a favor.", "effect": "The woman used flattery to flatter her friend.", "conceptual_explanation": "Wanting to ask her friend for a favor likely led the woman to use flattery to gain her friend's favor."}
{"index": "dev-57", "cause": "There is a hole in this pocket.", "effect": "The key in my pants pocket is missing.", "conceptual_explanation": "The presence of a hole in the pocket might have caused the key to fall out of the pants pocket."}
{"index": "dev-58", "cause": "He ran a marathon.", "effect": "The man fainted.", "conceptual_explanation": "Running a marathon might have caused the man to become physically exhausted, leading to fainting."}
{"index": "dev-59", "cause": "The game was disrupted.", "effect": "The man lost the game.", "conceptual_explanation": "The disruption of the game might have caused the man to lose focus or momentum, resulting in losing the game."}
{"index": "dev-60", "cause": "Her son fell off the bed.", "effect": "Mother called an ambulance.", "conceptual_explanation": "The son falling off the bed likely prompted the mother to call an ambulance due to concern for his well-being."}
{"index": "dev-61", "cause": "A deer appeared on the road.", "effect": "The driver slammed on the brakes.", "conceptual_explanation": "The appearance of a deer on the road likely prompted the driver to slam on the brakes to avoid hitting it."}
{"index": "dev-62", "cause": "I turned the key in the lock.", "effect": "The lock is unlocked.", "conceptual_explanation": "Turning the key in the lock likely caused the lock to become unlocked."}
{"index": "dev-63", "cause": "I am preparing to clean the bathroom.", "effect": "I put on rubber gloves.", "conceptual_explanation": "Preparing to clean the bathroom likely prompted you to put on rubber gloves to protect your hands."}
{"index": "dev-64", "cause": "Their habitat was destroyed.", "effect": "These species are on the verge of extinction.", "conceptual_explanation": "The destruction of their habitat likely put these species at risk of extinction."}
{"index": "dev-65", "cause": "The woman had her hair cut.", "effect": "Men think women look very different.", "conceptual_explanation": "The woman having her hair cut might have caused men to perceive her appearance as significantly different."}
{"index": "dev-66", "cause": "She made up an excuse for the teacher.", "effect": "The student forgot to do his homework.", "conceptual_explanation": "Making up an excuse for the teacher might have caused the student to forget to do his homework."}
{"index": "dev-67", "cause": "There was a knock on the door.", "effect": "The dog barked.", "conceptual_explanation": "The knock on the door likely prompted the dog to bark as a response to the unfamiliar noise."}
{"index": "dev-68", "cause": "Environmentalists started a petition.", "effect": "A plan to replace the local park with a shopping mall was announced.", "conceptual_explanation": "The petition started by environmentalists likely prompted the announcement of the plan to replace the local park with a shopping mall."}
{"index": "dev-69", "cause": "They kissed.", "effect": "The couple are very happy to see each other.", "conceptual_explanation": "Kissing likely led the couple to express happiness upon seeing each other."}
{"index": "dev-70", "cause": "He insulted her.", "effect": "The woman asked the man to leave.", "conceptual_explanation": "Being insulted likely prompted the woman to ask the man to leave as a response to feeling uncomfortable or offended."}
{"index": "dev-71", "cause": "The branches move downstream.", "effect": "The branches fell in the river.", "conceptual_explanation": "Moving downstream likely caused the branches to eventually fall into the river due to water flow."}
{"index": "dev-72", "cause": "The student complained.", "effect": "The teacher assigned the homework to the students.", "conceptual_explanation": "The student's complaint likely prompted the teacher to assign homework to the students in response."}
{"index": "dev-73", "cause": "The leaves fell from the tree.", "effect": "The season enters autumn from summer.", "conceptual_explanation": "The falling of leaves from the tree is a common sign of the transition from summer to autumn."}
{"index": "dev-74", "cause": "He was removed from office.", "effect": "The politician was convicted of fraud.", "conceptual_explanation": "Being removed from office might have been a consequence of the politician's conviction of fraud."}
{"index": "dev-75", "cause": "The wagon wheels spin forward.", "effect": "I pushed the carriage.", "conceptual_explanation": "The forward spinning of the wagon wheels likely indicates motion, prompting you to push the carriage."}
{"index": "dev-76", "cause": "The legislature passed the bill.", "effect": "The lobbyists persuaded the legislature to support the bill.", "conceptual_explanation": "The passage of the bill by the legislature might have been influenced by the persuasion of the lobbyists to support it."}
{"index": "dev-77", "cause": "I'm ready.", "effect": "My wardrobe is messy.", "conceptual_explanation": "Being ready might have led you to focus on other tasks, resulting in neglecting the organization of your wardrobe."}
{"index": "dev-78", "cause": "I am very tired in the morning.", "effect": "I stayed up late.", "conceptual_explanation": "Feeling very tired in the morning might indicate that you stayed up late the previous night."}
{"index": "dev-79", "cause": "His pocket is full of coins.", "effect": "The man's pockets clinked as he walked around.", "conceptual_explanation": "Having a pocket full of coins likely caused them to clink as the man walked around."}
{"index": "dev-80", "cause": "The student's phone rang.", "effect": "Everyone in the class stared at the student.", "conceptual_explanation": "The ringing of the student's phone likely drew attention from everyone in the class, causing them to stare at the student."}
{"index": "dev-81", "cause": "A fly bit the horse.", "effect": "This horse has its feet.", "conceptual_explanation": "The irritation caused by the fly biting the horse might have prompted the horse to kick its feet or move them in response."}
{"index": "dev-82", "cause": "The stolen jewelry was returned to the owner.", "effect": "The jewelry thief was caught.", "conceptual_explanation": "The return of the stolen jewelry likely led to the identification and capture of the jewelry thief."}
{"index": "dev-83", "cause": "Many citizens took refuge in other territories.", "effect": "Political riots broke out across the country.", "conceptual_explanation": "The mass movement of citizens seeking refuge in other territories might have sparked unrest and dissatisfaction, leading to political riots across the country."}
{"index": "dev-84", "cause": "She launched an attack.", "effect": "The woman was arrested.", "conceptual_explanation": "The act of launching an attack likely resulted in the woman's arrest due to legal consequences."}
{"index": "dev-85", "cause": "She knew the result of the election.", "effect": "The woman read the newspaper.", "conceptual_explanation": "Knowing the result of the election might have prompted the woman to read the newspaper to stay informed about current events."}
{"index": "dev-86", "cause": "His friend is sick.", "effect": "The sick child had a cough on his friend.", "conceptual_explanation": "The sickness of his friend likely caused the child to cough while interacting with him."}
{"index": "dev-87", "cause": "They planned a wedding.", "effect": "The couple are engaged.", "conceptual_explanation": "The act of planning a wedding might have led to the decision for the couple to become engaged."}
{"index": "dev-88", "cause": "This woman plans to buy an apartment.", "effect": "The woman contacted the real estate agent.", "conceptual_explanation": "The plan to buy an apartment likely prompted the woman to contact a real estate agent for assistance in finding suitable properties."}
{"index": "dev-89", "cause": "He became rich.", "effect": "The man won the lottery.", "conceptual_explanation": "Becoming rich might have been a consequence of winning the lottery."}
{"index": "dev-90", "cause": "The wax fell from the candle.", "effect": "I lit the candle.", "conceptual_explanation": "The falling of the wax from the candle might have prompted you to light the candle to use it."}
{"index": "dev-91", "cause": "My face is sunburned.", "effect": "I spent a day in the swimming pool.", "conceptual_explanation": "Spending a day in the swimming pool might have led to sunburn on your face due to prolonged exposure to the sun."}
{"index": "dev-92", "cause": "The parking meter has expired.", "effect": "The man received a ticket.", "conceptual_explanation": "The expiration of the parking meter likely led to the man receiving a ticket for parking violation."}
{"index": "dev-93", "cause": "The photographers followed her.", "effect": "The woman became famous.", "conceptual_explanation": "Being followed by photographers might have led to the woman gaining fame or public attention."}
{"index": "dev-94", "cause": "She pierced her ears.", "effect": "The girl wants to wear earrings.", "conceptual_explanation": "The act of piercing her ears likely prompted the girl to want to wear earrings as accessories."}
{"index": "dev-95", "cause": "I went to a concert.", "effect": "My ears are ringing.", "conceptual_explanation": "Attending a concert might have caused your ears to ring due to exposure to loud music."}
{"index": "dev-96", "cause": "I am waiting for friends to arrive.", "effect": "I cleaned up my room.", "conceptual_explanation": "The anticipation of friends arriving might have prompted you to clean up your room to make it presentable for their visit."}
{"index": "dev-97", "cause": "They compensated me.", "effect": "The airline did not handle my luggage properly.", "conceptual_explanation": "The mishandling of luggage by the airline likely led to compensation being provided to you as a remedy."}
{"index": "dev-98", "cause": "I bought a new one.", "effect": "This computer is expensive to repair.", "conceptual_explanation": "The purchase of a new computer might have been a consequence of the high cost of repairing the old one."}
{"index": "dev-99", "cause": "She asked her friend to leave her alone.", "effect": "The woman is in a bad mood.", "conceptual_explanation": "Asking her friend to leave her alone might have been a consequence of the woman being in a bad mood and needing space or solitude."}